Public Attributes | List of all members
API_CWFrameType Struct Reference
Element Manager API
Represents a Curtain Wall Frame element. More...
#include <APIdefs_Elements.h>
 Public Attributes
API_Elem_Head  | head
General element header.
short  | pen
For internal use.
API_AttributeIndex  | material
Material index of the frame's surface.
bool  | useOwnMaterial
The frame uses its own materials or materials defined in the library part (in case of GDL based frame).
API_AttributeIndex  | buildingMaterial
Building Material of the frame.
API_AttributeIndex  | cutLineType
Line index of the cut part of the frame on the floorplan.
short  | cutLinePen
Pen index of the cut part of the frame on the floorplan.
double  | d
Panel connection hole depth.
double  | w
Panel connection hole width.
double  | a1
Frame contour width inside. a1 and a2 are always equal and a1 + a2 = a on the Frame Type and Geometry tabpage of the Frame Settings Dialog.
double  | a2
Frame contour width outside. a1 and a2 are always equal and a1 + a2 = a on the Frame Type and Geometry tabpage of the Frame Settings Dialog.
double  | b1
Frame contour length inside. b1 = b - h on the Frame Type and Geometry tabpage of the Frame Settings Dialog.
double  | b2
Frame contour length outside. b2 = h on the Frame Type and Geometry tabpage of the Frame Settings Dialog.
double  | angle
Angle of the frame.
API_CWFrameObjectTypeID  | objectType
Type of the frame.
unsigned short  | connPriority
UInt32  | classID
API_Guid  | owner
API_Guid  | symbolID
The related library part's object identifier.
bool  | hasSymbol
True if the panel is a GDL object.
bool  | deleteFlag
Flags a panel class for deletion. In this case, the panel's className should be the name of the class to substitute it with.
bool  | defaultSubElem
Tells if this is the default panel for the curtain wall.
UInt32  | segmentID
Identifier of containing segment.
API_GridElemID  | cellID
The identifier of containing cell.
API_Coord  | begRel
Relative first point in cell.
API_Coord  | endRel
Relative second point in cell.
API_Coord3D  | begC
First point of the frame's reference line.
API_Coord3D  | endC
Second point of the frame's reference line.
API_Coord3D  | orientation
Orientation of the frame. This vector is always perpendicular to the vector defined by begC and endC coordinates.
UInt32  | joinedCWFramesBegCNum
Number of frames joined at begC.
UInt32  | joinedCWFramesEndCNum
Number of frames joined at endC.
UInt32  | assocCWPanelsNum
Number of associated panels - one frame border two panels.
Int32  | libInd
Object Library Part index if the frame is GDL based.
UInt32  | auxPanelDirsNum
Number of additional panel clamping vectors.
Int32  | contourID
Contour ID for contour frames; other has invalid value.
GS::uchar_t  | className [256]
Name of the frame's class.
Detailed Description
Represents a Curtain Wall Frame element.
Remarks
The Curtain Wall is a hierarchical (system) element consisting of Frame, Panel, Accessory and Junction components: these are the Members of the Curtain Wall, arranged on a Base Surface according to a pre-defined scheme.
Member Data Documentation
◆ a1
 API_CWFrameType::a1
Frame contour width inside. a1 and a2 are always equal and a1 + a2 = a on the Frame Type and Geometry tabpage of the Frame Settings Dialog.
◆ a2
 API_CWFrameType::a2
Frame contour width outside. a1 and a2 are always equal and a1 + a2 = a on the Frame Type and Geometry tabpage of the Frame Settings Dialog.
◆ angle
 API_CWFrameType::angle
Angle of the frame.
◆ assocCWPanelsNum
 API_CWFrameType::assocCWPanelsNum
Number of associated panels - one frame border two panels.
◆ auxPanelDirsNum
 API_CWFrameType::auxPanelDirsNum
Number of additional panel clamping vectors.
◆ b1
 API_CWFrameType::b1
Frame contour length inside. b1 = b - h on the Frame Type and Geometry tabpage of the Frame Settings Dialog.
◆ b2
 API_CWFrameType::b2
Frame contour length outside. b2 = h on the Frame Type and Geometry tabpage of the Frame Settings Dialog.
◆ begC
 API_CWFrameType::begC
First point of the frame's reference line.
◆ begRel
 API_CWFrameType::begRel
Relative first point in cell.
◆ buildingMaterial
 API_CWFrameType::buildingMaterial
Building Material of the frame.
◆ cellID
 API_CWFrameType::cellID
The identifier of containing cell.
◆ classID
 UInt32 API_CWFrameType::classID
◆ className
 API_CWFrameType::className
Name of the frame's class.
◆ connPriority
 unsigned short API_CWFrameType::connPriority
◆ contourID
 API_CWFrameType::contourID
Contour ID for contour frames; other has invalid value.
◆ cutLinePen
 API_CWFrameType::cutLinePen
Pen index of the cut part of the frame on the floorplan.
◆ cutLineType
 API_CWFrameType::cutLineType
Line index of the cut part of the frame on the floorplan.
◆ d
 API_CWFrameType::d
Panel connection hole depth.
◆ defaultSubElem
 API_CWFrameType::defaultSubElem
Tells if this is the default panel for the curtain wall.
◆ deleteFlag
 API_CWFrameType::deleteFlag
Flags a panel class for deletion. In this case, the panel's className should be the name of the class to substitute it with.
◆ endC
 API_CWFrameType::endC
Second point of the frame's reference line.
◆ endRel
 API_CWFrameType::endRel
Relative second point in cell.
◆ hasSymbol
 API_CWFrameType::hasSymbol
True if the panel is a GDL object.
◆ head
 API_CWFrameType::head
General element header.
The owner curtain wall.
The class identifier of the frame (previously known as category).
The priority of the frame in 3D intersections on a 1 to 19 scale.
◆ joinedCWFramesBegCNum
 API_CWFrameType::joinedCWFramesBegCNum
Number of frames joined at begC.
◆ joinedCWFramesEndCNum
 API_CWFrameType::joinedCWFramesEndCNum
Number of frames joined at endC.
◆ libInd
 API_CWFrameType::libInd
Object Library Part index if the frame is GDL based.
◆ material
 API_CWFrameType::material
Material index of the frame's surface.
◆ objectType
 API_CWFrameType::objectType
Type of the frame.
◆ orientation
 API_CWFrameType::orientation
Orientation of the frame. This vector is always perpendicular to the vector defined by begC and endC coordinates.
◆ owner
 API_Guid API_CWFrameType::owner
◆ pen
 API_CWFrameType::pen
For internal use.
◆ segmentID
 API_CWFrameType::segmentID
Identifier of containing segment.
◆ symbolID
 API_CWFrameType::symbolID
The related library part's object identifier.
◆ useOwnMaterial
 API_CWFrameType::useOwnMaterial
The frame uses its own materials or materials defined in the library part (in case of GDL based frame).
◆ w
 API_CWFrameType::w
Panel connection hole width.